Repository: aza4k/study
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ru, uz

source: English
ru: Английский
uz: Inglizcha

source: Russian
ru: Русский
uz: Ruscha

source: Qaraqalpaqsha
ru: Каракалпакский
uz: Qoraqalpoqcha

source: Uzbek
uz: O'zbekcha

source: Phone Number
ru: Номер телефона
uz: Telefon raqami

source: Age
ru: Возраст
uz: Yosh

source: Preferred Language
ru: Предпочитаемый язык
uz: Afzal til

source: Title
ru: Название
uz: Sarlavha

source: Description
ru: Описание
uz: Tavsif

source: Language
ru: Язык
uz: Til

source: Created At
ru: Создано
uz: Yaratilgan vaqt

source: Order
ru: Порядок
uz: Tartib

source: Markdown content
ru: Markdown контент
uz: Markdown kontent

source: Content
ru: Содержание
uz: Kontent

source: Question
ru: Вопрос
uz: Savol

source: List of options
ru: Список вариантов
uz: Variantlar ro'yxati

source: Options
ru: Варианты
uz: Variantlar

source: Correct Answer
ru: Правильный ответ
uz: To'g'ri javob

source: Universal Learning Platform
ru: Универсальная обучающая платформа
uz: Universal O'quv Platformasi

source: Courses
ru: Курсы
uz: Kurslar

source: Leaderboard
ru: Таблица лидеров
uz: Peshqadamlar

source: View Gamification
ru: Посмотреть геймификацию
uz: Yutuqlarni ko'rish

source: View
uz: Ko'rish

source: Logout
ru: Выйти
uz: Chiqish

source: Login
ru: Войти
uz: Kirish

source: Dashboard
ru: Панель управления
uz: Boshqaruv paneli

source: New Course
ru: Новый курс
uz: Yangi kurs

source: The world's most advanced AI-powered learning platform. Empowering education for everyone, everywhere.
ru: Самая передовая в мире обучающая платформа с ИИ. Расширение возможностей образования для всех и везде.
uz: Dunyodagi eng ilg'or sun'iy intellektli o'quv platformasi. Hamma uchun, hamma joyda ta'limni rivojlantirish.

source: Platform
ru: Платформа
uz: Platforma

source: About
ru: О нас
uz: Biz haqimizda

source: Developed by
ru: Разработано
uz: Ishlab chiqaruvchi

source: Making education accessible through AI
ru: Делаем образование доступным с помощью ИИ
uz: Sun'iy intellekt orqali ta'limni hammabop qilish

source: All rights reserved.
ru: Все права защищены.
uz: Barcha huquqlar himoyalangan.

source: AI Learning Assistant - StuDy
ru: ИИ Ассистент - StuDy
uz: AI O'quv Yordamchisi - StuDy

source: AI Learning Assistant
ru: ИИ Ассистент
uz: AI O'quv Yordamchisi

source: Ask me anything to generate a course
ru: Спросите меня о чем угодно, чтобы создать курс
uz: Kurs yaratish uchun menga istalgan savol bering

source: Hello
ru: Привет
uz: Salom

source: What would you like to learn today?
ru: Чему бы вы хотели научиться сегодня?
uz: Bugun nimani o'rganmoqchisiz?

source: Generating your personalized course...
ru: Создание вашего персонального курса...
uz: Sizga moslashtirilgan kurs yaratilmoqda...

source: This may take 20-30 seconds
ru: Это может занять 20-30 секунд
uz: Bu 20-30 soniya vaqt olishi mumkin

source: Generate Course
ru: Создать курс
uz: Kurs yaratish

source: Type your message...
ru: Введите ваше сообщение...
uz: Xabaringizni yozing...

source: Sorry, something went wrong. Please try again.
ru: Извините, что-то пошло не так. Пожалуйста, попробуйте снова.
uz: Kechirasiz, xatolik yuz berdi. Iltimos, qaytadan urinib ko'ring.

source: Error generating course:
ru: Ошибка при создании курса:
uz: Kurs yaratishda xatolik:

source: Error generating course. Please try again.
ru: Ошибка при создании курса. Пожалуйста, попробуйте снова.
uz: Kurs yaratishda xatolik. Iltimos, qaytadan urinib ko'ring.

source: Back to Dashboard
ru: Назад к панели
uz: Boshqaruv paneliga qaytish

source: Course Completed!
ru: Курс завершен!
uz: Kurs yakunlandi!

source: Congratulations! You've mastered this course. Download your official certificate now.
uz: Tabriklaymiz! Siz bu kursni muvaffaqiyatli tugatdingiz. Rasmiy sertifikatingizni hozir yuklab oling.

source: Download Certificate
ru: Скачать сертификат
uz: Sertifikatni yuklab olish

source: Completed
ru: Завершено
uz: Tugallangan

source: My Dashboard - StuDy
ru: Моя панель - StuDy
uz: Mening panelim - StuDy

source: Welcome back,
ru: С возвращением,
uz: Qaytganingiz bilan,

source: Continue your learning journey
ru: Продолжите свое обучение
uz: O'qishingizni davom ettiring

source: Your Courses
ru: Ваши курсы
uz: Kurslaringiz

source: modules
ru: модулей
uz: modullar

source: Progress
ru: Прогресс
uz: Jarayon

source: Review Course
ru: Обзор курса
uz: Kursni ko'rib chiqish

source: Continue Learning
ru: Продолжить обучение
uz: O'qishni davom ettirish

source: No Courses Yet
ru: Пока нет курсов
uz: Hali kurs yo'q

source: Start your learning journey by creating your first AI-powered course!
ru: Начните свое обучение, создав свой первый курс с ИИ!
uz: Birinchi AI-kurs yaratish orqali o'quv sayohatingizni boshlang!

source: Create Your First Course
ru: Создать свой первый курс
uz: Birinchi kursingizni yarating

source: Gamification - StuDy
ru: Геймификация - StuDy
uz: Gamifikatsiya - StuDy

source: Gamification
ru: Геймификация
uz: Gamifikatsiya

source: Track your progress, earn rewards, and level up your learning!
ru: Отслеживайте прогресс, получайте награды и повышайте уровень!
uz: Jarayoningizni kuzating, mukofotlar oling va o'qish darajangizni oshiring!

source: Keep Learning!
ru: Продолжайте учиться!
uz: O'qishni davom ettiring!

source: Complete activities to earn more XP
ru: Выполняйте задания, чтобы заработать больше XP
uz: Ko'proq XP olish uchun faoliyatlarni bajaring

source: How to Earn XP
ru: Как заработать XP
uz: XP qanday olish mumkin

source: Complete activities to gain experience points and unlock rewards
ru: Выполняйте задания, чтобы получить очки опыта и открыть награды
uz: Tajriba ballari olish va mukofotlarni ochish uchun faoliyatlarni bajaring

source: Complete a Lesson
ru: Завершить урок
uz: Darsni tugatish

source: Read through a lesson to gain knowledge
ru: Прочитайте урок, чтобы получить знания
uz: Bilim olish uchun darsni o'qing

source: Pass a Quiz
ru: Пройти тест
uz: Testdan o'tish

source: Test your knowledge and pass quizzes
ru: Проверьте свои знания и пройдите тесты
uz: Bilimingizni tekshiring va testlardan o'ting

source: +5 XP bonus for perfect score
ru: Бонус +5 XP за идеальный результат
uz: Mukammal ball uchun +5 XP bonus

source: Finish a Course
ru: Завершить курс
uz: Kursni tugatish

source: Complete all lessons and quizzes in a course
ru: Завершите все уроки и тесты в курсе
uz: Kursdagi barcha darslar va testlarni bajaring

source: Daily Login Streak
ru: Ежедневная серия входов
uz: Kunlik kirish seriyasi

source: Log in every day to maintain your streak
ru: Заходите каждый день, чтобы сохранить серию
uz: Seriyangizni saqlab qolish uchun har kuni kiring

source: Create First Course
ru: Создать первый курс
uz: Birinchi kurs yaratish

source: One-time bonus for creating your first course
ru: Единоразовый бонус за создание первого курса
uz: Birinchi kursingizni yaratish uchun bir martalik bonus

source: Share on Social Media
ru: Поделиться в соцсетях
uz: Ijtimoiy tarmoqlarda ulashish

source: Share your achievements with friends
ru: Поделитесь достижениями с друзьями
uz: Yutuqlaringizni do'stlaringiz bilan baham ko'ring

source: Once per week
ru: Раз в неделю
uz: Haftada bir marta

source: Reward Tiers
ru: Уровни наград
uz: Mukofot darajalari

source: Unlock premium subscription trials by earning XP
ru: Откройте пробные премиум-подписки, зарабатывая XP
uz: XP yig'ib premium obunalarni oching

source: Bronze Tier
ru: Бронзовый уровень
uz: Bronza daraja

source: 1-Day Plus Trial
ru: Пробная подписка Plus на 1 день
uz: 1 kunlik Plus sinov

source: Unlocked!
uz: Ochildi!

source: to unlock
ru: чтобы открыть
uz: ochish uchun

source: Silver Tier
ru: Серебряный уровень
uz: Kumush daraja

source: 1-Week Plus Trial
ru: Пробная подписка Plus на 1 неделю
uz: 1 haftalik Plus sinov

source: Gold Tier
ru: Золотой уровень
uz: Oltin daraja

source: 1-Week Pro Trial
ru: Пробная подписка Pro на 1 неделю
uz: 1 haftalik Pro sinov

source: Platinum Tier
ru: Платиновый уровень
uz: Platina daraja

source: 1-Month Plus Trial
ru: Пробная подписка Plus на 1 месяц
uz: 1 oylik Plus sinov

source: Diamond Tier
ru: Бриллиантовый уровень
uz: Olmos daraja

source: 1-Month Pro Trial
ru: Пробная подписка Pro на 1 месяц
uz: 1 oylik Pro sinov

source: Top Learners
ru: Лучшие ученики
uz: Eng yaxshi o'quvchilar

source: See how you rank against other students
ru: Посмотрите свое место среди других студентов
uz: Boshqa talabalar orasida o'rningizni ko'ring

source: No leaderboard data yet. Be the first to earn XP!
ru: Пока нет данных. Будьте первым, кто заработает XP!
uz: Hali peshqadamlar ro'yxati yo'q. XP olgan birinchi bo'ling!

source: View Full Leaderboard
ru: Посмотреть полную таблицу лидеров
uz: To'liq ro'yxatni ko'rish

source: Start Earning XP Today!
ru: Начните зарабатывать XP сегодня!
uz: Bugundan XP yig'ishni boshlang!

source: Complete lessons, pass quizzes, and unlock amazing rewards
ru: Завершайте уроки, проходите тесты и открывайте удивительные награды
uz: Darslarni tugatib, testlardan o'ting va ajoyib mukofotlarni oching

source: AI-Powered Education
ru: Образование с ИИ
uz: AI bilan ta'lim

source: Features
ru: Функции
uz: Imkoniyatlar

source: How It Works
ru: Как это работает
uz: Qanday ishlaydi

source: Pricing
ru: Цены
uz: Narxlar

source: Get Started
ru: Начать
uz: Boshlash

source: AI-Powered Learning Revolution
ru: Революция в обучении с ИИ
uz: AI bilan o'qish inqilobi

source: Master Any Skill with
ru: Освойте любой навык с
uz: Istalgan ko'nikmani egallang

source: Personalized AI Courses
ru: Персонализированными ИИ-курсами
uz: Shaxsiy AI kurslar bilan

source: Generate custom courses on any topic in seconds. Learn in your preferred language, track your progress, and earn certificates.
ru: Создавайте индивидуальные курсы на любую тему за секунды. Учитесь на предпочитаемом языке, отслеживайте прогресс и получайте сертификаты.
uz: Ixtiyoriy mavzuda maxsus kurslarni soniyalarda yarating. O'zingizga qulay tilda o'rganing, jarayoningizni kuzating va sertifikatlar oling.

source: Start Learning Free
ru: Начать обучение бесплатно
uz: Bepul o'qishni boshlash

source: See How It Works
ru: Посмотрите, как это работает
uz: Qanday ishlashini ko'ring

source: Topics
ru: Темы
uz: Mavzular

source: Languages
ru: Языки
uz: Tillar

source: Students
ru: Студенты
uz: Talabalar

source: Rating
ru: Рейтинг
uz: Reyting

source: Why Choose StuDy?
ru: Почему выбирают StuDy?
uz: Nega StuDy'ni tanlash kerak?

source: Experience the future of education with our cutting-edge features.
ru: Почувствуйте будущее образования с нашими передовыми функциями.
uz: Ilg'or imkoniyatlarimiz bilan ta'limning kelajagini his qiling.

source: AI-Powered Curriculum
ru: Учебная программа на базе ИИ
uz: AI bilan dastur

source: Our advanced AI analyzes your request and builds a structured, comprehensive course tailored just for you.
ru: Наш продвинутый ИИ анализирует ваш запрос и создает структурированный, всесторонний курс, специально для вас.
uz: Bizning ilg'or AI so'rovingizni tahlil qiladi va aynan siz uchun moslashtirilgan tuzilmali, keng qamrovli kurs yaratadi.

source: Multi-Language Support
ru: Мультиязычная поддержка
uz: Ko'p tilni qo'llab-quvvatlash

source: Learn in English, Russian, Uzbek, or any other language. The AI adapts the content to your native tongue.
ru: Учитесь на английском, русском, узбекском или любом другом языке. ИИ адаптирует контент под ваш родной язык.
uz: Ingliz, rus, o'zbek yoki boshqa tillarda o'rganing. AI kontentni ona tilingizga moslaydi.

source: Gamified Learning
ru: Геймифицированное обучение
uz: O'yinlashtirilgan o'qish

source: Earn XP, climb the leaderboard, and unlock achievements. Learning has never been this addictive.
ru: Зарабатывайте XP, поднимайтесь в таблице лидеров и открывайте достижения. Обучение никогда не было таким увлекательным.
uz: XP yig'ing, peshqadamlar ro'yxatida ko'tariling va yutuqlarni oching. O'qish hech qachon bunday qiziqarli bo'lmagan.

source: Official Certificates
ru: Официальные сертификаты
uz: Rasmiy sertifikatlar

source: Complete courses and earn beautiful, shareable certificates to showcase your achievements.
ru: Завершайте курсы и получайте красивые сертификаты, которыми можно поделиться, чтобы продемонстрировать свои достижения.
uz: Kurslarni tugatib, yutuqlaringizni namoyish qilish uchun chiroyli, ulashiladigan sertifikatlar oling.

source: Progress Tracking
ru: Отслеживание прогресса
uz: Jarayonni kuzatish

source: Monitor your learning journey with detailed analytics and progress reports for every course.
ru: Отслеживайте свое обучение с помощью подробной аналитики и отчетов о прогрессе для каждого курса.
uz: Har bir kurs uchun batafsil tahlil va jarayon hisobotlari bilan o'quv sayohatingizni kuzating.

source: Instant Generation
ru: Мгновенная генерация
uz: Tezkor yaratish

source: Get your personalized course in under 30 seconds. No waiting, just learning.
ru: Получите свой персональный курс менее чем за 30 секунд. Никакого ожидания, только обучение.
uz: Shaxsiy kursingizni 30 soniyadan kam vaqtda oling. Kutish yo'q, faqat o'qish.

source: Start your learning journey in three simple steps.
ru: Начните свое обучение в три простых шага.
uz: O'quv sayohatingizni uch oddiy qadamda boshlang.

source: Choose a Topic
ru: Выберите тему
uz: Mavzu tanlang

source: Tell our AI chatbot what you want to learn, from Python to Pottery.
ru: Скажите нашему ИИ-чатботу, чему вы хотите научиться, от Python до гончарного дела.
uz: AI chatbotimizga Python'dan kulolchilikka qadar nimani o'rganmoqchi ekanligingizni ayting.

source: Get Your Course
ru: Получите свой курс
uz: Kursingizni oling

source: The AI instantly generates modules, lessons, and quizzes for you.
ru: ИИ мгновенно создает для вас модули, уроки и тесты.
uz: AI siz uchun darhol modullar, darslar va testlarni yaratadi.

source: Start Learning
ru: Начните обучение
uz: O'qishni boshlang

source: Read lessons, take quizzes, earn XP, and get certified!
ru: Читайте уроки, проходите тесты, получайте XP и сертификаты!
uz: Darslarni o'qing, testlardan o'ting, XP oling va sertifikat oling!

source: Simple, Affordable Pricing
ru: Простые и доступные цены
uz: Oddiy, arzon narxlar

source: Choose the plan that fits your learning goals
ru: Выберите план, который соответствует вашим целям обучения
uz: O'quv maqsadlaringizga mos rejani tanlang

source: Free
ru: Бесплатно
uz: Bepul

source: per month
ru: в месяц
uz: oyiga

source: 3 AI-generated courses per month
ru: 3 ИИ-курса в месяц
uz: Oyiga 3 ta AI kurs

source: Basic progress tracking
ru: Базовое отслеживание прогресса
uz: Oddiy jarayon kuzatish

source: Community support
ru: Поддержка сообщества
uz: Jamiyat yordami

source: Course certificates
ru: Сертификаты курсов
uz: Kurs sertifikatlari

source: Unlimited AI-generated courses
ru: Неограниченное количество ИИ-курсов
uz: Cheksiz AI kurslar

source: Advanced analytics & insights
ru: Продвинутая аналитика и инсайты
uz: Kengaytirilgan tahlil va tushunchalar

source: Priority AI generation
ru: Приоритетная генерация ИИ
uz: Ustuvor AI yaratish

source: Premium certificates
ru: Премиум сертификаты
uz: Premium sertifikatlar

source: Email support
ru: Поддержка по электронной почте
uz: Email yordami

source: Start Plus Trial
ru: Начать пробную версию Plus
uz: Plus sinovini boshlash

source: Everything in Plus
ru: Все, что в Plus
uz: Plus'dagi hamma narsa

source: AI Learning Assistant for every lesson
ru: ИИ-ассистент для каждого урока
uz: Har bir dars uchun AI yordamchi

source: Custom course templates
ru: Пользовательские шаблоны курсов
uz: Maxsus kurs shablonlari

source: Offline course downloads
ru: Скачивание курсов для офлайн доступа
uz: Oflayn kurs yuklash

source: Priority 24/7 support
ru: Приоритетная поддержка 24/7
uz: Ustuvor 24/7 yordam

source: Early access to new features
ru: Ранний доступ к новым функциям
uz: Yangi imkoniyatlarga erta kirish

source: Start Pro Trial
ru: Начать пробную версию Pro
uz: Pro sinovini boshlash

source: 30-day money-back guarantee. Cancel anytime.
ru: 30-дневная гарантия возврата денег. Отмена в любое время.
uz: 30 kunlik pul qaytarish kafolati. Istalgan vaqtda bekor qilish.

source: Frequently Asked Questions
ru: Часто задаваемые вопросы
uz: Ko'p so'raladigan savollar

source: Everything you need to know about StuDy
ru: Все, что вам нужно знать о StuDy
uz: StuDy haqida bilishingiz kerak bo'lgan hamma narsa

source: How does the AI generate courses?
ru: Как ИИ создает курсы?
uz: AI kurslarni qanday yaratadi?

source: Our advanced AI analyzes your topic request and creates a comprehensive curriculum with modules, lessons, and quizzes tailored to your learning needs.
ru: Наш продвинутый ИИ анализирует ваш запрос и создает структурированный, всесторонний курс с модулями, уроками и тестами, специально для вас.
uz: Bizning ilg'or AI mavzu so'rovingizni tahlil qiladi va o'quv ehtiyojlaringizga moslashtirilgan modullar, darslar va testlar bilan keng qamrovli dastur yaratadi.

source: Can I really learn in any language?
ru: Могу ли я действительно учиться на любом языке?
uz: Haqiqatan ham istalgan tilda o'rgana olamanmi?

source: Yes! Our AI supports 50+ languages including English, Russian, Uzbek, Karakalpak, and many more. Just specify your preferred language.
ru: Да! Наш ИИ поддерживает более 50 языков, включая английский, русский, узбекский, каракалпакский и многие другие. Просто укажите предпочитаемый язык.
uz: Ha! Bizning AI 50+ tilni qo'llab-quvvatlaydi, jumladan ingliz, rus, o'zbek, qoraqalpoq va boshqa ko'plab tillar. Faqat afzal tilingizni ko'rsating.

source: Are the certificates recognized?
ru: Признаются ли сертификаты?
uz: Sertifikatlar tan olinadimi?

source: Our certificates showcase your achievement and can be shared on LinkedIn, resumes, and portfolios to demonstrate your skills.
ru: Наши сертификаты демонстрируют ваши достижения, и ими можно поделиться в LinkedIn, резюме и портфолио, чтобы показать свои навыки.
uz: Bizning sertifikatlar yutuqlaringizni namoyish etadi va ko'nikmalaringizni ko'rsatish uchun LinkedIn, rezyume va portfoliolarda ulashilishi mumkin.

source: Can I cancel my subscription anytime?
ru: Могу ли я отменить подписку в любое время?
uz: Obunani istalgan vaqtda bekor qila olamanmi?

source: Absolutely! You can cancel your Plus or Pro subscription at any time with no questions asked. We also offer a 30-day money-back guarantee.
ru: Абсолютно! Вы можете отменить подписку Plus или Pro в любое время без лишних вопросов. Мы также предлагаем 30-дневную гарантию возврата денег.
uz: Albatta! Plus yoki Pro obunangizni istalgan vaqtda hech qanday savolsiz bekor qilishingiz mumkin. Shuningdek, 30 kunlik pul qaytarish kafolatini taklif qilamiz.

source: Ready to Start Your Journey?
ru: Готовы начать свое путешествие?
uz: Sayohatingizni boshlashga tayyormisiz?

source: Join thousands of learners and master new skills today. It's free to get started.
ru: Присоединяйтесь к тысячам учеников и осваивайте новые навыки уже сегодня. Это бесплатно.
uz: Minglab o'quvchilarga qo'shiling va bugun yangi ko'nikmalarni o'rganing. Boshlash bepul.

source: Create Free Account
ru: Создать бесплатный аккаунт
uz: Bepul hisob yaratish

source: No credit card required
ru: Кредитная карта не требуется
uz: Kredit karta talab qilinmaydi

source: Start learning in 30 seconds
ru: Начните учиться через 30 секунд
uz: 30 soniyada o'qishni boshlang

source: Rise through the ranks and become a legend in the Universal Learning Platform.
ru: Поднимайтесь в рейтинге и станьте легендой Универсальной обучающей платформы.
uz: Darajalardan ko'tariling va Universal O'quv Platformasida afsonaga aylaning.

source: Your Score
ru: Ваш счет
uz: Sizning balingiz

source: XP to
ru: XP до
uz: XP kerak:

source: Bronze
uz: Bronza

source: Silver
uz: Kumush

source: Gold
uz: Oltin

source: Max League Reached!
uz: Maksimal liga erishildi!

source: League
uz: Liga

source: Full Rankings
uz: To'liq reyting

source: Top 100 Learners
uz: Eng yaxshi 100 o'quvchi

source: Rank
uz: O'rin

source: Learner
uz: O'quvchi

source: Total XP
uz: Jami XP

source: You
uz: Siz

source: No Rankings Yet
uz: Hali reyting yo'q

source: Be the first to complete a lesson and earn XP!
uz: Dars tugatib XP olgan birinchi bo'ling!

source: Back to Course
uz: Kursga qaytish

source: Quiz Time!
ru: Время теста!
uz: Test vaqti!

source: You have already completed this lesson!
ru: Вы уже прошли этот урок!
uz: Siz allaqachon bu darsni tugatgansiz!

source: Previous Lesson
ru: Предыдущий урок
uz: Oldingi dars

source: Next Lesson
ru: Следующий урок
uz: Keyingi dars

source: Complete Module
ru: Завершить модуль
uz: Modulni tugatish

source: Check Answer
ru: Проверить ответ
uz: Javobni tekshirish

source: No quizzes for this lesson.
ru: Для этого урока нет тестов.
uz: Bu dars uchun testlar yo'q.

source: Lesson Complete!
ru: Урок завершен!
uz: Dars tugadi!

source: Great job! You've answered all questions correctly.
ru: Отличная работа! Вы правильно ответили на все вопросы.
uz: Ajoyib! Barcha savollarga to'g'ri javob berdingiz.

source: Lesson Assistant
ru: Ассистент урока
uz: Dars yordamchisi

source: Ask me about this lesson
ru: Спросите меня об этом уроке
uz: Bu dars haqida so'rang

source: Hi! I'm here to help you understand this lesson. Feel free to ask me questions about the content!
ru: Привет! Я здесь, чтобы помочь вам понять этот урок. Не стесняйтесь задавать вопросы по содержанию!
uz: Salom! Men sizga bu darsni tushunishga yordam berish uchun keldim. Kontent haqida bemalol savol bering!

source: Note: I can't help with quiz answers, but I'll explain concepts to help you learn!
ru: Примечание: Я не могу подсказать ответы на тест, но я объясню концепции, чтобы помочь вам учиться!
uz: Eslatma: Test javoblari bilan yordam bera olmayman, lekin o'rganishingizga yordam berish uchun tushunchalarni tushuntiraman!

source: Ask about this lesson...
ru: Спросите об этом уроке...
uz: Bu dars haqida so'rang...

source: Ask AI Helper
ru: Спросить ИИ
uz: AI yordamchidan so'rang

source: Login - Universal Learning Platform
ru: Вход - Универсальная обучающая платформа
uz: Kirish - Universal O'quv Platformasi

source: Back to Home
ru: На главную
uz: Bosh sahifaga

source: Welcome Back
ru: С возвращением
uz: Qaytganingiz bilan

source: Username
ru: Имя пользователя
uz: Foydalanuvchi nomi

source: Password
ru: Пароль
uz: Parol

source: Sign In
ru: Войти
uz: Kirish

source: Don't have an account?
ru: Нет аккаунта?
uz: Hisobingiz yo'qmi?

source: Create Account
ru: Создать аккаунт
uz: Hisob yaratish

source: AI Assistant
ru: ИИ Ассистент
uz: AI yordamchi

source: Correct!
ru: Правильно!
uz: To'g'ri!

source: Great job! You earned 10 XP.
ru: Отличная работа! Вы заработали 10 XP.
uz: Ajoyib! 10 XP oldingiz.

source: Incorrect
ru: Неправильно
uz: Noto'g'ri

source: You lost 5 XP.
ru: Вы потеряли 5 XP.
uz: 5 XP yo'qotdingiz.

source: Correct answer:
ru: Правильный ответ:
uz: To'g'ri javob:

source: Pricing - StuDy
uz: Narxlar - StuDy

source: Register - Universal Learning Platform
ru: Регистрация - Универсальная обучающая платформа
uz: Ro'yxatdan o'tish - Universal O'quv Platformasi

source: Start your learning journey today
ru: Начните обучение сегодня
uz: Bugun o'quv sayohatingizni boshlang

source: First Name
ru: Имя
uz: Ism

source: Last Name
ru: Фамилия
uz: Familiya

source: Phone
ru: Телефон
uz: Telefon

source: Confirm Password
ru: Подтвердите пароль
uz: Parolni tasdiqlang

source: Already have an account?
ru: Уже есть аккаунт?
uz: Allaqachon hisobingiz bormi?

source: My Dashboard - ULP
ru: Моя панель - ULP

source: Plus
ru: Плюс

source: Pro
ru: Про
